Revit 2027 API
OBJImportOptions(OBJImportOptions) Constructor
 Constructs a new instance of OBJImportOptions as a copy of the import options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OBJImportOptions(
	OBJImportOptions option
)
Public Sub New (
	option As OBJImportOptions
)
public:
OBJImportOptions(
	OBJImportOptions^ option
)
new :
        option : OBJImportOptions -> OBJImportOptions
Parameters
option OBJImportOptions
 The OBJ options to be copied.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
OBJImportOptions Class
OBJImportOptions Overload
Autodesk.Revit.DB Namespace